# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
p = (input('Введите число: '))
d = (input('Введите точность определения числа: '))
count_d = len(d)
print(count_d)
print(p[:count_d])


